#!/usr/bin/env python3
#coding=utf-8

import os
import tool
import re

class BrandRecallOpt(object):
    """
    todo: 米家需要程序单独处理
    """
    def __init__(self, standard_brand_file):
        if not os.path.exists(standard_brand_file):
            raise Exception("%s does not exists!" % standard_brand_file)
        self.standard_brand_file = standard_brand_file

    def mijia_special_brand_recall(self, b_id, cat1_id, cat1_name):
        """
        标准品牌中将【米家】合并到了小米
        :return:
        """
        # 10698337        Xiaomi/小米     100031  家用电器        1143728907.83730000
        xiaomi_brand_id = "10698337"
        mijia_brand_id = "10698337"
        mijia_brand_name = "MIJIA/米家"

        # b_id, ori_b_name, cat1_id, cat1, gmv = lst1
        if b_id == xiaomi_brand_id:
            ext_band_name = self.english_brand_extension("MIJIA/米家/小米米家")
            return "\t".join([mijia_brand_id, mijia_brand_name, ext_band_name, cat1_id, cat1_name, "0.0"])
        else:
            return ""
        """
        10698337	Xiaomi/小米	Xiaomi/小米Xiaomi/小米/Xiaomi小米	100028	电脑、办公	502831022.86170000
        """

    def del_brand_id(self, b_id):
        del_brand_dict = {'10061008': ['dayu food/大宇', '仅仅做食品的品牌'],
                          '10994630': ['zme/子美', '易错'],
                          '99714406': ['京弗', '做酒精的'],
                          '10280013': ["上家", ''],
                          '10553676': ['多星', ''],
                          '10913403': ['鸳鸯', ''],
                          '10768362': ['mini', ''],
                          '10628073': ['Coati/小浣熊', '品牌冲突，类目错误'],
                          '10433275': ['爱心', ''],
                          '10264331': ['style/风格', ''],
                          '10429327': ['catmi/猫咪', ''],
                          '12660777': ['美足宝（医疗器械）', ''],
                          '10119397': ['甲壳虫', ''],
                          '10840653': ['htc', ''],
                          '10265662': ["茶花", ''],
                          '10916258': ['柳叶', ''],
                          '10335998': ['修正', ''],
                          '10128206': ['全能', ''],
                          '10839373': ['Hello Kitty', ''],
                          '10262756': ['格子', ''],
                          '10846885': ['磁悬', ''],
                          '10848143': ['至尊', ''],
                          '10189360': ['Sansui/山水', ''],
                          '10271793': ['ter', ''],
                          '10562996': ['一步到位', ''],
                          '10503736': ['miji', ''],
                          '10943683': ['雪花（家电）', ''],
                          '10401889': ['小金', ''],
                          '10345694': ['水香', ''],
                          '10935205': ['PICOOC/有品', ''],
                          '10943031': ['速电', ''],
                          '10943464': ['光明（牛奶）', ''],
                          '10555548': ['大马力', ''],
                          '10203880': ['冬夏', ''],
                          '10332014': ['炫酷', ''],
                          '10265737': ['JOY BOLD/金棒', ''],
                          '10770153': ['韩派', '重复的品牌名'],
                          '10651821': ['CKS/科顺', '重复的品牌名'],
                          '10670736': ['御尚堂', '重复的品牌名'],
                          '10956775': ['开品', ''],
                          '10651221': ['茶时代', ''],
                          '10484805': ['威力', ''],
                          '10411201': ['PANDA/熊猫', '']}
        short_eng_brand_dict = {'10972123': ['nhk', '长度小于三的英文非重点品牌易出错'], '10556637': ['SYP', '长度小于三的英文非重点品牌易出错'],
                                '11013585': ['jpq', '长度小于三的英文非重点品牌易出错'], '10916050': ['ynd', '长度小于三的英文非重点品牌易出错'],
                                '10594442': ['FEO', '长度小于三的英文非重点品牌易出错'], '10192091': ['123', '长度小于三的英文非重点品牌易出错'],
                                '10336253': ['GY', '长度小于三的英文非重点品牌易出错'], '10050720': ['ENA', '长度小于三的英文非重点品牌易出错'],
                                '10554646': ['KAI', '长度小于三的英文非重点品牌易出错'], '12653716': ['ZNC', '长度小于三的英文非重点品牌易出错'],
                                '10433322': ['FRK', '长度小于三的英文非重点品牌易出错'], '10936743': ['WP', '长度小于三的英文非重点品牌易出错'],
                                '5792589155': ['JSL', '长度小于三的英文非重点品牌易出错'], '10480050': ['kqp', '长度小于三的英文非重点品牌易出错'],
                                '10905443': ['HAY', '长度小于三的英文非重点品牌易出错'], '10364566': ['hlk', '长度小于三的英文非重点品牌易出错'],
                                '10840505': ['MB', '长度小于三的英文非重点品牌易出错'], '10017967': ['±0', '长度小于三的英文非重点品牌易出错'],
                                '10268693': ['SNK', '长度小于三的英文非重点品牌易出错'], '10736728': ['VTU', '长度小于三的英文非重点品牌易出错'],
                                '10698756': ['FHL', '长度小于三的英文非重点品牌易出错'], '10696766': ['JR', '长度小于三的英文非重点品牌易出错'],
                                '12654753': ['USC', '长度小于三的英文非重点品牌易出错'], '10555306': ['QG', '长度小于三的英文非重点品牌易出错'],
                                '10906826': ['ZMI', '长度小于三的英文非重点品牌易出错'], '10792898': ['SS', '长度小于三的英文非重点品牌易出错'],
                                '10698330': ['edo', '长度小于三的英文非重点品牌易出错'], '12655834': ['KGV', '长度小于三的英文非重点品牌易出错'],
                                '10477592': ['BWT', '长度小于三的英文非重点品牌易出错'], '10588040': ['HOT', '长度小于三的英文非重点品牌易出错'],
                                '10408745': ['CTT', '长度小于三的英文非重点品牌易出错'], '10452909': ['DS', '长度小于三的英文非重点品牌易出错'],
                                '10625855': ['HB', '长度小于三的英文非重点品牌易出错'], '10937895': ['iqs', '长度小于三的英文非重点品牌易出错'],
                                '10768492': ['ST', '长度小于三的英文非重点品牌易出错'], '10684390': ['HG', '长度小于三的英文非重点品牌易出错'],
                                '10220336': ['GLM', '长度小于三的英文非重点品牌易出错'], '10439316': ['orz', '长度小于三的英文非重点品牌易出错'],
                                '10624548': ['sy', '长度小于三的英文非重点品牌易出错'], '10353002': ['PUR', '长度小于三的英文非重点品牌易出错'],
                                '10361671': ['FMS', '长度小于三的英文非重点品牌易出错'], '10624391': ['df', '长度小于三的英文非重点品牌易出错'],
                                '10372186': ['TVI', '长度小于三的英文非重点品牌易出错'], '12655740': ['ViH', '长度小于三的英文非重点品牌易出错'],
                                '10768356': ['XGE', '长度小于三的英文非重点品牌易出错'], '99714411': ['AEG', '长度小于三的英文非重点品牌易出错'],
                                '10488892': ['PGG', '长度小于三的英文非重点品牌易出错'], '11027306': ['CIH', '长度小于三的英文非重点品牌易出错'],
                                '10361431': ['352', '长度小于三的英文非重点品牌易出错'], '10340276': ['JEJ', '长度小于三的英文非重点品牌易出错'],
                                '10444466': ['KM', '长度小于三的英文非重点品牌易出错'], '10003238': ['MF', '长度小于三的英文非重点品牌易出错'],
                                '10696918': ['QVB', '长度小于三的英文非重点品牌易出错'], '10264629': ['bl', '长度小于三的英文非重点品牌易出错'],
                                '10094811': ['EAT', '长度小于三的英文非重点品牌易出错'], '11024524': ['wuc', '长度小于三的英文非重点品牌易出错'],
                                '10155459': ['ZR', '长度小于三的英文非重点品牌易出错'], '10069174': ['EKO', '长度小于三的英文非重点品牌易出错'],
                                '10142276': ['ESR', '长度小于三的英文非重点品牌易出错'], '10627370': ['ett', '长度小于三的英文非重点品牌易出错'],
                                '10219780': ['WM', '长度小于三的英文非重点品牌易出错'], '10265910': ['XP', '长度小于三的英文非重点品牌易出错'],
                                '11028542': ['SK2', '长度小于三的英文非重点品牌易出错'], '10559069': ['AG', '长度小于三的英文非重点品牌易出错'],
                                '10285633': ['UXH', '长度小于三的英文非重点品牌易出错'], '10358171': ['MTG', '长度小于三的英文非重点品牌易出错'],
                                '10046885': ['BZR', '长度小于三的英文非重点品牌易出错'], '10408326': ['505', '长度小于三的英文非重点品牌易出错'],
                                '10480311': ['ZK', '长度小于三的英文非重点品牌易出错'], '12655455': ['JXG', '长度小于三的英文非重点品牌易出错'],
                                '10937346': ['CJH', '长度小于三的英文非重点品牌易出错'], '10063761': ['ROV', '长度小于三的英文非重点品牌易出错'],
                                '10861960': ['JSK', '长度小于三的英文非重点品牌易出错'], '10840578': ['BS', '长度小于三的英文非重点品牌易出错'],
                                '10942011': ['720', '长度小于三的英文非重点品牌易出错'], '10910022': ['CnW', '长度小于三的英文非重点品牌易出错'],
                                '10568015': ['EKS', '长度小于三的英文非重点品牌易出错'], '12660361': ['DKU', '长度小于三的英文非重点品牌易出错'],
                                '11031658': ['XGP', '长度小于三的英文非重点品牌易出错'], '10513182': ['JL', '长度小于三的英文非重点品牌易出错'],
                                '10629624': ['JRC', '长度小于三的英文非重点品牌易出错'], '10920760': ['4°', '长度小于三的英文非重点品牌易出错'],
                                '11028896': ['dpc', '长度小于三的英文非重点品牌易出错'], '10699282': ['TQJ', '长度小于三的英文非重点品牌易出错'],
                                '10135599': ['dgq', '长度小于三的英文非重点品牌易出错'], '10553009': ['GUM', '长度小于三的英文非重点品牌易出错'],
                                '10196342': ['TNN', '长度小于三的英文非重点品牌易出错'], '10878225': ['U.M', '长度小于三的英文非重点品牌易出错'],
                                '10274841': ['PUT', '长度小于三的英文非重点品牌易出错'], '10366686': ['EUP', '长度小于三的英文非重点品牌易出错'],
                                '10499482': ['ZLS', '长度小于三的英文非重点品牌易出错'], '10852649': ['Nu', '长度小于三的英文非重点品牌易出错'],
                                '10280058': ['TEK', '长度小于三的英文非重点品牌易出错'], '10508936': ['T1', '长度小于三的英文非重点品牌易出错'],
                                '10652817': ['ZD', '长度小于三的英文非重点品牌易出错'], '10074336': ['NB', '长度小于三的英文非重点品牌易出错'],
                                '10408718': ['UE', '长度小于三的英文非重点品牌易出错'], '3129604058': ['SKK', '长度小于三的英文非重点品牌易出错'],
                                '10838102': ['3M', '长度小于三的英文非重点品牌易出错'], '10929430': ['AOC', '长度小于三的英文非重点品牌易出错'],
                                '10408358': ['360', '长度小于三的英文非重点品牌易出错'], '10003950': ['GK', '长度小于三的英文非重点品牌易出错'],
                                '10764098': ['H＆K', '长度小于三的英文非重点品牌易出错'], '10773196': ['XHE', '长度小于三的英文非重点品牌易出错'],
                                '10863164': ['B＆Y', '长度小于三的英文非重点品牌易出错'], '10562917': ['RLS', '长度小于三的英文非重点品牌易出错'],
                                '10264497': ['LB', '长度小于三的英文非重点品牌易出错'], '10075361': ['YF', '长度小于三的英文非重点品牌易出错'],
                                '10753122': ['xn', '长度小于三的英文非重点品牌易出错'], '10652892': ['JEC', '长度小于三的英文非重点品牌易出错'],
                                '10621781': ['AB', '长度小于三的英文非重点品牌易出错'], '10132222': ['lHL', '长度小于三的英文非重点品牌易出错'],
                                '10772588': ['AME', '长度小于三的英文非重点品牌易出错'], '10407324': ['23°', '长度小于三的英文非重点品牌易出错'],
                                '10651454': ['TCL', '长度小于三的英文非重点品牌易出错'], '10761980': ['TMT', '长度小于三的英文非重点品牌易出错'],
                                '12658290': ['oiq', '长度小于三的英文非重点品牌易出错'], '10841190': ['D＆N', '长度小于三的英文非重点品牌易出错'],
                                '10149947': ['ABZ', '长度小于三的英文非重点品牌易出错'], '10842372': ['WMF', '长度小于三的英文非重点品牌易出错'],
                                '10268156': ['VH', '长度小于三的英文非重点品牌易出错'], '10342586': ['ugp', '长度小于三的英文非重点品牌易出错'],
                                '11027256': ['59S', '长度小于三的英文非重点品牌易出错'], '10324237': ['DHC', '长度小于三的英文非重点品牌易出错'],
                                '10555408': ['Aag', '长度小于三的英文非重点品牌易出错'], '10909458': ['IVR', '长度小于三的英文非重点品牌易出错'],
                                '10269663': ['DOB', '长度小于三的英文非重点品牌易出错'], '10817517': ['HKU', '长度小于三的英文非重点品牌易出错'],
                                '10350970': ['USK', '长度小于三的英文非重点品牌易出错'], '10194938': ['LEC', '长度小于三的英文非重点品牌易出错'],
                                '10051005': ['AFC', '长度小于三的英文非重点品牌易出错'], '10076611': ['AEA', '长度小于三的英文非重点品牌易出错'],
                                '12653881': ['tyr', '长度小于三的英文非重点品牌易出错'], '10848663': ['APD', '长度小于三的英文非重点品牌易出错'],
                                '10412810': ['umi', '长度小于三的英文非重点品牌易出错'], '10851513': ['1℃', '长度小于三的英文非重点品牌易出错'],
                                '10125433': ['dht', '长度小于三的英文非重点品牌易出错'], '10058796': ['QTQ', '长度小于三的英文非重点品牌易出错'],
                                '10431913': ['V1', '长度小于三的英文非重点品牌易出错'], '10771573': ['KH', '长度小于三的英文非重点品牌易出错'],
                                '10840618': ['MT', '长度小于三的英文非重点品牌易出错'], '10801940': ['HNM', '长度小于三的英文非重点品牌易出错'],
                                '10829280': ['VGO', '长度小于三的英文非重点品牌易出错'], '10124432': ['T3', '长度小于三的英文非重点品牌易出错'],
                                '10593560': ['IAM', '长度小于三的英文非重点品牌易出错'], '10987866': ['CGK', '长度小于三的英文非重点品牌易出错'],
                                '10048685': ['CEC', '长度小于三的英文非重点品牌易出错'], '10629983': ['JAV', '长度小于三的英文非重点品牌易出错'],
                                '10974793': ['OLT', '长度小于三的英文非重点品牌易出错'], '10894172': ['ABP', '长度小于三的英文非重点品牌易出错'],
                                '10943773': ['MKE', '长度小于三的英文非重点品牌易出错'], '10626694': ['KMC', '长度小于三的英文非重点品牌易出错'],
                                '10060500': ['JHS', '长度小于三的英文非重点品牌易出错'], '10849352': ['KEX', '长度小于三的英文非重点品牌易出错'],
                                '10770920': ['RCA', '长度小于三的英文非重点品牌易出错'], '10199805': ['IHD', '长度小于三的英文非重点品牌易出错'],
                                '10548999': ['VAA', '长度小于三的英文非重点品牌易出错'], '10568913': ['ZYD', '长度小于三的英文非重点品牌易出错'],
                                '10701069': ['DHP', '长度小于三的英文非重点品牌易出错'], '10268715': ['PO：', '长度小于三的英文非重点品牌易出错'],
                                '10791242': ['JBL', '长度小于三的英文非重点品牌易出错'], '10276306': ['oxg', '长度小于三的英文非重点品牌易出错'],
                                '10624415': ['JS', '长度小于三的英文非重点品牌易出错'], '10006184': ['GHD', '长度小于三的英文非重点品牌易出错'],
                                '10234002': ['GML', '长度小于三的英文非重点品牌易出错'], '10242117': ['HF', '长度小于三的英文非重点品牌易出错'],
                                '10552444': ['HC', '长度小于三的英文非重点品牌易出错'], '10570668': ['BFU', '长度小于三的英文非重点品牌易出错'],
                                '10192153': ['LS', '长度小于三的英文非重点品牌易出错'], '10259771': ['XCX', '长度小于三的英文非重点品牌易出错'],
                                '10087147': ['ncu', '长度小于三的英文非重点品牌易出错'], '10937858': ['TYG', '长度小于三的英文非重点品牌易出错'],
                                '10167965': ['OCE', '长度小于三的英文非重点品牌易出错'], '10480019': ['MP', '长度小于三的英文非重点品牌易出错'],
                                '10944722': ['UP', '长度小于三的英文非重点品牌易出错'], '10408515': ['CR', '长度小于三的英文非重点品牌易出错'],
                                '10727553': ['OPE', '长度小于三的英文非重点品牌易出错'], '10128478': ['IPO', '长度小于三的英文非重点品牌易出错'],
                                '10483071': ['3L', '长度小于三的英文非重点品牌易出错'], '10696970': ['328', '长度小于三的英文非重点品牌易出错'],
                                '10119987': ['SJ', '长度小于三的英文非重点品牌易出错'], '11008301': ['SJG', '长度小于三的英文非重点品牌易出错'],
                                '4614298224': ['UJG', '长度小于三的英文非重点品牌易出错'], '10645329': ['V’S', '长度小于三的英文非重点品牌易出错'],
                                '10837040': ['ecx', '长度小于三的英文非重点品牌易出错'], '10268049': ['AIX', '长度小于三的英文非重点品牌易出错'],
                                '12657891': ['HGK', '长度小于三的英文非重点品牌易出错'], '10579023': ['ATD', '长度小于三的英文非重点品牌易出错'],
                                '10515895': ['KTJ', '长度小于三的英文非重点品牌易出错'], '10266738': ['KUS', '长度小于三的英文非重点品牌易出错'],
                                '10363325': ['TS', '长度小于三的英文非重点品牌易出错'], '10768959': ['SKG', '长度小于三的英文非重点品牌易出错'],
                                '10866020': ['KKC', '长度小于三的英文非重点品牌易出错'], '10938335': ['OTO', '长度小于三的英文非重点品牌易出错'],
                                '10114846': ['knn', '长度小于三的英文非重点品牌易出错'], '10053631': ['vkv', '长度小于三的英文非重点品牌易出错'],
                                '10782640': ['PMD', '长度小于三的英文非重点品牌易出错'], '10426742': ['QIC', '长度小于三的英文非重点品牌易出错'],
                                '10036959': ['MS', '长度小于三的英文非重点品牌易出错'], '10852259': ['lot', '长度小于三的英文非重点品牌易出错'],
                                '10319801': ['OES', '长度小于三的英文非重点品牌易出错'], '10261664': ['OJA', '长度小于三的英文非重点品牌易出错'],
                                '10628719': ['SBK', '长度小于三的英文非重点品牌易出错'], '10773503': ['RSR', '长度小于三的英文非重点品牌易出错']}
        if b_id in del_brand_dict:
            return True
        elif b_id in short_eng_brand_dict:
            return True
        else:
            return False

    def english_brand_extension(self, brand_name):
        """
        target: 将扩展的品牌直接保存值召回品牌中
        1）指定品牌
        2）标准品牌

        第一种情况：去特殊字符
        A.H.C/爱和纯  ->  AHC爱和纯  -> A.H.C/爱和纯/AHC爱和纯
        A.O.史密斯    ->  AO史密斯   -> A.O.史密斯/AO史密斯

        第二种情况：去英文的空格
        MAKE UP FOR EVER  -> MAKEUPFOREVER
        COLOR KEY -> COLORKEY
        a b c/某某某  -> abc/a b c/某某某/abc某某某
        :return:
        """
        def _single_brand_ext(tmp_b_name):
            # 去除空格
            b1 = re.sub(r"[\s]+", "", tmp_b_name)
            # 去除.
            b2 = tmp_b_name.replace(".", "").replace("．", "")
            r_lst = list(set([tmp_b_name, b1, b2]))
            return r_lst

        # 10943455        Hisense/海信（黑电）
        ok_brand_name = ""
        tmp = brand_name.strip().replace("（", "(").replace("）", "").replace(")", "")
        lst2 = tmp.split("(")
        if len(lst2) == 2:
            b1 = lst2[0]
            if tool.is_all_eng(lst2[1]):
                b2 = lst2[1]
                ok_brand_name = b2 + "/" + b1
            else:
                ok_brand_name = b1
        else:
            ok_brand_name = brand_name

        brand_lst = ok_brand_name.strip().split("/")
        brand_lst = list(set([tmp.strip() for tmp in brand_lst]))
        re_brand_lst = []
        if len(brand_lst) == 1:
            re_brand_lst += _single_brand_ext(brand_lst[0])
        else:
            en_brand_lst = []
            ch_brand_lst = []
            other_brand_lst = []
            for b in brand_lst:
                if tool.is_all_eng(b):
                    en_brand_lst.append(b)
                elif tool.is_all_chinese(b):
                    ch_brand_lst.append(b)
                else:
                    other_brand_lst.append(b)
            en_brand_ext_lst = []
            for z in en_brand_lst:
                en_brand_ext_lst += _single_brand_ext(z)
            mix_brand_lst = []
            for y in en_brand_ext_lst:
                for x in ch_brand_lst:
                    mix_brand_lst.append(y+x)
                    mix_brand_lst.append(x+y)
            re_brand_lst = mix_brand_lst + en_brand_ext_lst + ch_brand_lst + other_brand_lst

        re_brand_lst = list(set(re_brand_lst))
        #print(re_brand_lst)

        return "/".join(re_brand_lst)

    def brand_recall(self, output_file="pdd_xjd_brand_recall_info.txt"):
        ex_brand_dict = tool.get_exchange_brand_pair()

        special_brand_list = []
        mijia_lst = []
        with open(self.standard_brand_file, "r", encoding="utf-8") as f1:
            for line in f1:
                line = line.strip()
                if line == "": continue
                # brand_id, brand_name, cat2_id, cat2, gmv
                lst1 = line.split("\t")
                if len(lst1) != 5:
                    continue
                lst1 = [tmp.strip() for tmp in lst1]
                b_id, b_name, cat2_id, cat2, gmv = lst1
                if len(b_name) == 1: continue
                if self.del_brand_id(b_id): continue
                ori_b_name = b_name
                if b_name in ex_brand_dict:
                    b_name = ex_brand_dict[b_name]
                b_name = tool.brand_clean(b_name.lower())
                ext_band_name = self.english_brand_extension(b_name)
                special_brand_list.append("\t".join([b_id, ori_b_name, ext_band_name, cat2_id, cat2, gmv]))
                s9 = self.mijia_special_brand_recall(b_id, cat2_id, cat2)
                if s9 != "": mijia_lst.append(s9)

        r_lst = special_brand_list + mijia_lst
        with open(output_file, "w", encoding="utf-8") as f1:
            f1.write("\n".join(r_lst))
            f1.flush()

